Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignSettings Properties
The AnalysisDesignSettings type exposes the following members.
Properties
Name | Description
ConcreteDesignCode
 The concrete design code.
ConcreteDesignMethod
 The concrete design method.
SteelDesignCode
 The steel design code.
SteelDesignMethod
 The steel design method.
TimberDesignCode
 The timber design code.
TimberDesignMethod
 The timber design method.
Top
See Also
Reference
AnalysisDesignSettings Class
Tekla.Structures.Analysis Namespace